vmux0.0.8/ycsbVMs_ycsb_8vms_vmux-dpdk-e810_-1rps_rep0/vm2.log
/nix/store/2vwkssqpzykk37r996cafq7x63imf4sp-openjdk-21+35/bin/java  -classpath /nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/conf:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/core-0.17.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/HdrHistogram-2.1.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/htrace-core4-4.1.0-incubating.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-core-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-mapper-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/commons-pool2-2.4.2.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/jedis-2.9.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6380 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
Command line: -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6380 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
YCSB Client 0.17.0

Loading workload...
Starting test.
Maximum execution time specified as: 61 secs
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2024-07-10 23:52:33:026 0 sec: 0 operations; est completion in 0 second 
2024-07-10 23:52:42:873 10 sec: 88225 operations; 8822.5 current ops/sec; est completion in 13 hours 31 minutes [READ: Count=43947, Max=47615, Min=77, Avg=108.27, 90=124, 99=210, 99.9=712, 99.99=4171] [UPDATE: Count=44290, Max=10663, Min=77, Avg=107.98, 90=124, 99=225, 99.9=883, 99.99=3811] 
2024-07-10 23:52:52:873 20 sec: 188720 operations; 10049.5 current ops/sec; est completion in 12 hours 38 minutes [READ: Count=50177, Max=3813, Min=77, Avg=98.58, 90=109, 99=156, 99.9=238, 99.99=2093] [UPDATE: Count=50306, Max=2651, Min=72, Avg=97.08, 90=107, 99=154, 99.9=224, 99.99=1779] 
2024-07-10 23:53:02:873 30 sec: 289308 operations; 10058.8 current ops/sec; est completion in 12 hours 21 minutes [READ: Count=50403, Max=7975, Min=74, Avg=98.69, 90=109, 99=155, 99.9=232, 99.99=1744] [UPDATE: Count=50185, Max=5491, Min=74, Avg=97.2, 90=108, 99=155, 99.9=234, 99.99=1441] 
2024-07-10 23:53:12:874 40 sec: 388719 operations; 9941.1 current ops/sec; est completion in 12 hours 15 minutes [READ: Count=49994, Max=3785, Min=73, Avg=99.95, 90=111, 99=176, 99.9=285, 99.99=2181] [UPDATE: Count=49417, Max=7947, Min=75, Avg=98.1, 90=110, 99=169, 99.9=265, 99.99=511] 
2024-07-10 23:53:22:873 50 sec: 490723 operations; 10200.4 current ops/sec; est completion in 12 hours 8 minutes [READ: Count=50979, Max=3311, Min=77, Avg=97.28, 90=108, 99=151, 99.9=199, 99.99=398] [UPDATE: Count=51025, Max=7519, Min=75, Avg=95.86, 90=106, 99=148, 99.9=195, 99.99=1697] 
2024-07-10 23:53:32:873 60 sec: 593914 operations; 10319.1 current ops/sec; est completion in 12 hours 2 minutes [READ: Count=51631, Max=3271, Min=76, Avg=96.24, 90=106, 99=132, 99.9=198, 99.99=836] [UPDATE: Count=51560, Max=2809, Min=73, Avg=94.62, 90=105, 99=128, 99.9=176, 99.99=1668] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
2024-07-10 23:53:33:884 61 sec: 604253 operations; 10226.51 current ops/sec; est completion in 12 hours 1 minute [READ: Count=5110, Max=3511, Min=78, Avg=97.4, 90=106, 99=144, 99.9=187, 99.99=2819] [CLEANUP: Count=1, Max=943, Min=943, Avg=943, 90=943, 99=943, 99.9=943, 99.99=943] [UPDATE: Count=5229, Max=3161, Min=77, Avg=94.99, 90=104, 99=139, 99.9=166, 99.99=1261] 
[OVERALL], RunTime(ms), 61015
[OVERALL], Throughput(ops/sec), 9903.351634843892
[TOTAL_GCS_Copy], Count, 56
[TOTAL_GC_TIME_Copy], Time(ms), 22
[TOTAL_GC_TIME_%_Copy], Time(%), 0.03605670736704089
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 56
[TOTAL_GC_TIME], Time(ms), 22
[TOTAL_GC_TIME_%], Time(%), 0.03605670736704089
[READ], Operations, 302241
[READ], AverageLatency(us), 99.59489281732128
[READ], MinLatency(us), 73
[READ], MaxLatency(us), 47615
[READ], 95thPercentileLatency(us), 120
[READ], 99thPercentileLatency(us), 160
[READ], Return=OK, 302241
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 943.0
[CLEANUP], MinLatency(us), 943
[CLEANUP], MaxLatency(us), 943
[CLEANUP], 95thPercentileLatency(us), 943
[CLEANUP], 99thPercentileLatency(us), 943
[UPDATE], Operations, 302012
[UPDATE], AverageLatency(us), 98.20270386607154
[UPDATE], MinLatency(us), 72
[UPDATE], MaxLatency(us), 10663
[UPDATE], 95thPercentileLatency(us), 119
[UPDATE], 99thPercentileLatency(us), 159
[UPDATE], Return=OK, 302012
AUTOTEST_DONE